=================EDA==============

1)Pandas:Data frame applications

2)numpy:Numerical python All math applications

3)Matplotlib:used for plotting

4)seaborn:used for plotting

5)plotly:used for plotting

6)bokhe:used for plotting 

==================ML==============

1)sickit_learn:sklearn

================DL===============

1)tensorflow:it is developed by google

2)keras :also developed by google 

3)pytorch: by facebook

===========NLP===========

1)NLTK: natural language tool kit

2)scipy:

=================BERT=============

1)transformers:hugging face(google)

====================google models==============

1)specific google packages

======================Azure ML===================

1)azure packages

======================GenAI=================

1)geminiai:google

2)chatgpt:openai

====================langchain==============

1)langchain packages

In [2]:
a=100
b=200
c=a+b
c

300

**Create a data frame using list**

$step-1$

create empty data frame

In [3]:
import pandas as pd
names=['ayush','avinash','akash']
pd.DataFrame() #empty data frame will create no rows and no columns

Empty DataFrame
Columns: []
Index: []

$step-2$

**provide data**

In [4]:
import pandas as pd
names=['ayush','avinash','akash']
age=[12,13,16]
l1=['name','age']
pd.DataFrame(zip(names,age),columns=l1)
#first poritional argument:data
#second positional arg:index

      name  age
0    ayush   12
1  avinash   13
2    akash   16

In [5]:
import pandas as pd
names=['ayush','avinash','akash']
city=["hyd","blr","che"]
l1=['name','age','city']
age=[12,13,16]
pd.DataFrame(zip(names,age,city),columns=l1)

      name  age city
0    ayush   12  hyd
1  avinash   13  blr
2    akash   16  che

$Step-3$

**provide the column names**

In [6]:
import pandas as pd
names=['ayush','avinash','akash']
city=["hyd","blr","che"]
l1=['name','age','city']
data=zip(names,age,city)
age=[12,13,16]
pd.DataFrame(data,columns=l1)

      name  age city
0    ayush   12  hyd
1  avinash   13  blr
2    akash   16  che

In [7]:
import pandas as pd
names=['ayush','avinash','akash']
city=["hyd","blr","che"]
l1=['name','age','city']
data=zip(names,age,city)
age=[12,13,16]
df=pd.DataFrame(data,columns=l1)
type(df)

pandas.core.frame.DataFrame

$step-4$

**add new column**

- if you want to add new column

- first you need o check the number of rows in already existed data

- for example in above the dataframes has 3 rows

- you need to create a new list with 3 rows

- that list equate to the dataframe

In [8]:
import pandas as pd
names=['ayush','avinash','akash']
city=["hyd","blr","che"]
l1=['name','age','city','job']
jobs=['data analyst','data scientist','data engineer']
data=zip(names,age,city,jobs)
age=[12,13,16]
df=pd.DataFrame(data,columns=l1)
df

      name  age city             job
0    ayush   12  hyd    data analyst
1  avinash   13  blr  data scientist
2    akash   16  che   data engineer

$step-5$

**update already existed column**

In [9]:
import pandas as pd
names=['ayush','avinash','akash']
city=["hyd","blr","che"]
l1=['name','age','city','job']
jobs=['data analyst','data scientist','data engineer']
data=zip(names,age,city,jobs)
age=[12,13,16]
df=pd.DataFrame(data,columns=l1)
df['age']=[31,32,33]
df

      name  age city             job
0    ayush   31  hyd    data analyst
1  avinash   32  blr  data scientist
2    akash   33  che   data engineer

$step-6$

**how to change the index**

In [10]:
import pandas as pd
names=['venu penu','venky monkey','pavan','vinay']
city=["hyd","blr","che",'hyd']
l1=['name','age','city','job']
ix=['A','B','C','D']
jobs=['data analyst','data scientist','data engineer','student']
data=zip(names,age,city,jobs)
age=[12,13,16,21]
df=pd.DataFrame(data,index=ix,columns=l1)
df

ValueError: Length of values (3) does not match length of index (4)

**note**
- number of list equals to number of columns

- number of values inside list equals to **number of rows**

- when you create the data all the lists will be in same length

$step-7$

**shape**

- number of rows

- number of columns

In [11]:
df.shape
#matrix format
#4 rows and 4 columns

(3, 4)

In [12]:
print("the number of rows are :",df.shape[0])

the number of rows are : 3

$step-8$

**how to drop the column**

- in order to drop the column we req 3 arguments

- column name
  
     - the column name we need to mention

- axis

  - axis=0 represents rows

  - axis=1 represents columns
 
- inplace

    - we are drop the column means we are modifying the data frames
 
    - so this modification we want to save in same variable or different variable
 
    - if you want to keep in the same variable the **inplace=True**

In [13]:
df.drop('job',axis=1,)

      name  age city
0    ayush   31  hyd
1  avinash   32  blr
2    akash   33  che

$step-9$

**multiple columns**

In [14]:
import pandas as pd
names=['ayush','avinash','akash']
city=["hyd","blr","che"]
l1=['name','age','city','job']
jobs=['data analyst','data scientist','data engineer']
data=zip(names,age,city,jobs)
age=[12,13,16]
df=pd.DataFrame(data,columns=l1)
df['age']=[31,32,33]
df

      name  age city             job
0    ayush   31  hyd    data analyst
1  avinash   32  blr  data scientist
2    akash   33  che   data engineer

In [15]:
df.drop([0,1],axis=0,inplace=True)
df

    name  age city            job
2  akash   33  che  data engineer

$step-11$

**how to save the data frame**

  - generally data frames are two types

  - csv(comma seperated value)

  - excel

In [16]:
df

    name  age city            job
2  akash   33  che  data engineer

In [17]:
import pandas as pd
names=['ayush','avinash','akash']
city=["hyd","blr","che"]
l1=['name','age','city','job']
jobs=['data analyst','data scientist','data engineer']
data=zip(names,age,city,jobs)
age=[12,13,16]
df=pd.DataFrame(data,columns=l1)
df['age']=[31,32,33]
df

      name  age city             job
0    ayush   31  hyd    data analyst
1  avinash   32  blr  data scientist
2    akash   33  che   data engineer

In [19]:
df.to_csv("file2.csv",index=False)

In [21]:
df.to_excel("file4.xlsx",index=False)